START_MESSAGE = """
Добро пожаловать в sb_too_easy_travel.
Используйте следующие команды:
/help — помощь по командам бота
/lowprice — вывод самых дешёвых отелей в городе
/highprice — вывод самых дорогих отелей в городе
/bestdeal — вывод отелей, наиболее подходящих по цене и расположению от центра
/history — вывод истории поиска отелей
"""
HELP_MEASSAGE = """
/lowprice — вывод самых дешёвых отелей в городе
/highprice — вывод самых дорогих отелей в городе
/bestdeal — вывод отелей, наиболее подходящих по цене и расположению от центра
/history — вывод истории поиска отелей
"""
ERROR_CONTENT_MESSAGE = 'Извините, но зачем Вы мне это шлете? 🤷‍♂️'