# location_id
LOCATION_ID_START = '🌍 Введите название города:'
LOCATION_ID_WRONG = '❌ Город не найден. Попробуйте еще раз.'
LOCATION_ID_COMPLETE = 'Выбран город 🌆 **{}**'
# check_in
CHECK_IN_START = '🗓 Выберите дату заезда:'
CHECK_IN_WRONG = '❌ Дата заезда не верная. Попробуйте еще раз.'
CHECK_IN_COMPLETE = 'Выбрана дата заезда 📆 **{}**.'
# check_out
CHECK_OUT_START = '🗓 Выберите дату выезда:'
CHECK_OUT_WRONG = '❌ Дата выезда не верная. Попробуйте еще раз.'
CHECK_OUT_COMPLETE = 'Выбрана дата выезда 📅 **{}**.'
# price_min
PRICE_MIN_START = '💰 Введите минимальную цену:'
PRICE_MIN_WRONG = '❌ Цена должа быть числом. Попробуйте еще раз.'
PRICE_MIN_COMPLETE = 'Минимальная цена 💰 **{:.2f} {}**.'
# price_max
PRICE_MAX_START = '💰 Введите максимальную цену:'
PRICE_MAX_WRONG = (
    '❌ Цена должа быть числом больше минимальной цены. '
    'Попробуйте еще раз.')
PRICE_MAX_COMPLETE = 'Максимальная цена 💰 **{:.2f} {}**.'
# distance_min
DISTANCE_MIN_START = '📏 Введите минимальное расстояние от центра города:'
DISTANCE_MIN_WRONG = (
    '❌ Расстояние должно быть числом больше нуля. Попробуйте еще раз')
DISTANCE_MIN_COMPLETE = (
    'Минимальное расстояние от центра города 📏 **{:.1f} {}**.')
# distance_max
DISTANCE_MAX_START = '📏 Введите максимальную удаленность от центра города:'
DISTANCE_MAX_WRONG = (
    '❌ Расстояние должно быть числом больше нуля '
    'и больше минимального расстояния. Попробуйте еще раз')
DISTANCE_MAX_COMPLETE = (
    'Максимальная удаленность от центра города 📏 **{:.1f}**.')
# results_num
RESULTS_NUM_START = '📝 Введите количество результатов (не больше {}):'
RESULTS_NUM_WRONG = (
    '❌ Количество должно быть числом больше нуля. Поробуйте еще раз.')
RESULTS_NUM_COMPLETE = 'Количество результатов 📝 **{:d}**.'
# photos_num
PHOTOS_NUM_START = '🖼 Введителе количество фотографий отеля:'
PHOTOS_NUM_WRONG = '❌ Количество должно быть числом. Поробуйте еще раз.'
PHOTOS_NUM_COMPLETE = 'Количество фотографий 🖼 **{:d}**.'
# complete
COMPLETE_START = '🏨 Найдено **{:d}** предложений.'
COMPLETE_WRONG = '🛎 Предложений не найдено. Попробуйте еще раз.'
