# common
BAD_CONTENT_MESSAGE = 'Извините, но зачем Вы мне это шлете? 🤷‍♂️'
UNKNOWN_ERROR_MESSAGE = 'Ooops 🤭'
# commands
START_MESSAGE = (
    'Добро пожаловать в *sb_too_easy_travel*.\n'
    'Используйте следующие команды:\n'
    '_/help_ — помощь по командам бота\n'
    '_/lowprice_ — вывод самых дешёвых отелей в городе\n'
    '_/highprice_ — вывод самых дорогих отелей в городе\n'
    '_/bestdeal_ — вывод отелей, наиболее подходящих по '
    'цене и расположению от центра\n'
    '_/history_ — вывод истории поиска отелей'
)
HELP_MESSAGE = (
    '_/lowprice_ — вывод самых дешёвых отелей в городе\n'
    '_/highprice_ — вывод самых дорогих отелей в городе\n'
    '_/bestdeal_ — вывод отелей, наиболее подходящих по '
    'цене и расположению от центра\n'
    '_/history_ — вывод истории поиска отелей'
)
LOWPRICE_MESSAGE = 'Команда *LowPrice* покажет лучшие предложения.'
HIGHPRICE_MESSSAGE = 'Команда *HighPrice* покажет дорогие предложения.'
BESTDEAL_MESSAGE = (
    'Команда *BestDeal* подберет лучшие предложения по заданной цене '
    'и расположению.'
)
# LocationId
LID_START_MESSAGE = '*Введите название города*:'
LID_FINISH_MESSAGE = 'Выбран город '
LID_ASK_MESSAGE = 'Выберите нужный город или уточните запрос.'
LID_WRONG_MESSAGE = 'Я не знаю такого города. Попробуйте еще раз.'
# dates
CHECK_IN_START_MESSAGE = 'Выберите дату заезда:'
CHECK_IN_FINISH_MESSAGE = 'Дата заезда '
CHECK_OUT_START_MESSAGE = 'Выберите дату выезда:'
CHECK_OUT_FINISH_MESSAGE = 'Дата выезда '
# price
MIN_PRICE_START_MESSAGE = 'Введите *минимальную* стоимость.'
MAX_PRICE_START_MESSAGE = 'Введите *максимальную* стоимость.'
PRICE_WRONG_MESSAGE = 'Стоимость должна быть целым числом.'
